---
type: VertexIndexPairArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# VertexIndexPairArray

`Autodesk.Revit.DB.VertexIndexPairArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VertexIndexPairArray | — | `public VertexIndexPairArray ()` |
| Method | Append | — | `public virtual void Append ( VertexIndexPair item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual VertexIndexPairArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( VertexIndexPair item , int index )` |
| Method | ReverseIterator | — | `public virtual VertexIndexPairArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual VertexIndexPair this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |